# EDA_PROJECT

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

pd.set_option('display.max_columns', None)

In [2]:
s17=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Sales_2017.csv")
s16=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Sales_2016.csv")
s15=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Sales_2015.csv")
customer=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Customers.csv")
products=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Products.csv")
returns=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Returns.csv")
categories= pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Product_Categories.csv")
subcategories=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Product_Subcategories.csv")
area=pd.read_csv("DATA/Dataset_kaggel/AdventureWorks_Territories.csv")

In [3]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18148 entries, 0 to 18147
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerKey     18148 non-null  int64
 1   Prefix          18018 non-null  object
 2   FirstName       18148 non-null  object
 3   LastName        18148 non-null  object
 4   BirthDate       18148 non-null  object
 5   MaritalStatus   18148 non-null  object
 6   Gender          18018 non-null  object
 7   EmailAddress    18148 non-null  object
 8   AnnualIncome    18148 non-null  object
 9   TotalChildren   18148 non-null  int64
 10  EducationLevel  18148 non-null  object
 11  Occupation      18148 non-null  object
 12  HomeOwner       18148 non-null  object
dtypes: int64(2), object(11)
memory usage: 1.8+ MB

In [4]:
print(s17.columns)
print(s16.columns)
print(s15.columns)
print(customer.columns)
print(products.columns)
print(returns.columns)
print(categories.columns)
print(subcategories.columns)
print(area.columns)

Index(['OrderDate', 'StockDate', 'OrderNumber', 'ProductKey', 'CustomerKey',
       'TerritoryKey', 'OrderLineItem', 'OrderQuantity'],
      dtype='object')
Index(['OrderDate', 'StockDate', 'OrderNumber', 'ProductKey', 'CustomerKey',
       'TerritoryKey', 'OrderLineItem', 'OrderQuantity'],
      dtype='object')
Index(['OrderDate', 'StockDate', 'OrderNumber', 'ProductKey', 'CustomerKey',
       'TerritoryKey', 'OrderLineItem', 'OrderQuantity'],
      dtype='object')
Index(['CustomerKey', 'Prefix', 'FirstName', 'LastName', 'BirthDate',
       'MaritalStatus', 'Gender', 'EmailAddress', 'AnnualIncome',
       'TotalChildren', 'EducationLevel', 'Occupation', 'HomeOwner'],
      dtype='object')
Index(['ProductKey', 'ProductSubcategoryKey', 'ProductSKU', 'ProductName',
       'ModelName', 'ProductDescription', 'ProductColor', 'ProductSize',
       'ProductStyle', 'ProductCost', 'ProductPrice'],
      dtype='object')
Index(['ReturnDate', 'TerritoryKey', 'ProductKey', 'ReturnQuantity'], dtype='object')
Index(['ProductCategoryKey', 'CategoryName'], dtype='object')
Index(['ProductSubcategoryKey', 'SubcategoryName', 'ProductCategoryKey'], dtype='object')
Index(['TerritoryKey', 'Region', 'Country', 'Continent'], dtype='object')

### Available Datasets

- OrderDate', 'StockDate', 'OrderNumber', 'ProductKey', 'CustomerKey','TerritoryKey', 'OrderLineItem', 'OrderQuantity'

- 'CustomerKey', 'Prefix', 'FirstName', 'LastName', 'BirthDate','MaritalStatus', 'Gender', 'EmailAddress', AnnualIncome','TotalChildren', 'EducationLevel', 'Occupation', 'HomeOwner'
       
- 'ProductKey', 'ProductSubcategoryKey', 'ProductSKU', 'ProductName', 'ModelName', 'ProductDescription', 'ProductColor', 'ProductSize', 'ProductStyle', 'ProductCost', 'ProductPrice'
       
- 'ReturnDate', 'TerritoryKey', 'ProductKey', 'ReturnQuantity

- 'ProductCategoryKey', 'CategoryName'

- 'productSubcategoryKey', 'SubcategoryName', 'ProductCategoryKey'

### CUSTOMERS
1. Annual Income & product purchase relation
2. Most purchased order by customer name, Territory wise, 
3. Female most ordered product vs male most oder product
4. Gender , home owner matters in order purchasing
5. Education level and child and annual income relation.
6. Martial Status single and above 50 age purchase
7. Best age group people purchasing 
8. Top annual income persons ordered product 
9. Most ordered proudct customer name and there annual income
10. Paritial high school vs bachlors income mean and who orders the more valued products.
11. People who bachelors & Clerical & Home owner & annual Income 40000

### SALES
1. Most ordered Product, category, subcategory
2. Most products orders region wise.

### DATE
1. Orders by year, month
2. peak days of orders from previous date data
3. pivot table of all the products month wise
4. how many peoples orderes on there birthdate

### Other Visualization
1. Bar chart of all months sales in year wise.
2. Orderes sales line chart of all three years.. live chart.

### Dashboard of all time
1. Top 5 Products
2. Top 5 Category
3. Top 5 valuable Customer by sales amount.

In [5]:
sales=pd.concat([s15,s16,s17],ignore_index=True)

In [6]:
#sales.to_csv("sales.csv")

In [46]:
sales= pd.read_csv("sales.csv")

In [48]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     56046 non-null  int64
 1   OrderDate      56046 non-null  object
 2   StockDate      56046 non-null  object
 3   OrderNumber    56046 non-null  object
 4   ProductKey     56046 non-null  int64
 5   CustomerKey    56046 non-null  int64
 6   TerritoryKey   56046 non-null  int64
 7   OrderLineItem  56046 non-null  int64
 8   OrderQuantity  56046 non-null  int64
dtypes: int64(6), object(3)
memory usage: 3.8+ MB

In [88]:
product_= pd.merge(sales, products, on="ProductKey", how="inner")
final_= pd.merge(product_, customer, on="CustomerKey", how="inner")
final_ = pd.merge(final_, subcategories, on="ProductSubcategoryKey", how="inner")
final_ = pd.merge(final_, categories, on="ProductCategoryKey", how="inner")
final_ = pd.merge(final_, area, on = ["TerritoryKey"], how = "inner")

TypeError: merge() got an unexpected keyword argument 'ignore_index'

In [ ]:
final_['OrderDate']=pd.to_datetime(final_['OrderDate'])
final_['BirthDate']=pd.to_datetime(final_['BirthDate'])

In [141]:
final_['AnnualIncome'] = final_['AnnualIncome'].str.replace(',', '')
final_['AnnualIncome'] = final_['AnnualIncome'].str.replace('$', '')
final_["AnnualIncome"] = final_["AnnualIncome"].astype(dtype="float")

<ipython-input-141-383e3b62d597>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  final_['AnnualIncome'] = final_['AnnualIncome'].str.replace('$', '')

In [118]:
final_['t_purchase']=final_["OrderQuantity"]+ final_["ProductPrice"]
final_['p_cost']=final_["OrderQuantity"]+ final_["ProductCost"]

In [ ]:
final_['s_year'] = final_['OrderDate'].dt.year
final_['s_month'] = final_['OrderDate'].dt.month
final_['s_date'] = final_['OrderDate'].dt.day

final_['b_year'] = final_['BirthDate'].dt.year
final_['b_month'] = final_['BirthDate'].dt.month
final_['b_date'] = final_['BirthDate'].dt.day

In [203]:
final_["age"] = 2017 - final_['b_year']

In [54]:
final_.head()

   Unnamed: 0  OrderDate   StockDate OrderNumber  ProductKey  CustomerKey  \
0           0   1/1/2015   9/21/2001     SO45080         332        14657
1         221   2/6/2015  10/12/2001     SO45383         332        14734
2        9498   9/1/2016   5/25/2003     SO53659         387        14734
3         366   3/3/2015   1/27/2002     SO45596         332        20564
4         520  3/26/2015    2/5/2002     SO45748         332        18046

   TerritoryKey  OrderLineItem  OrderQuantity  ProductSubcategoryKey  \
0             1              1              1                      2
1             1              1              1                      2
2             1              1              1                      2
3            10              1              1                      2
4             7              1              1                      2

   ProductSKU            ProductName   ModelName  \
0  BK-R50B-58     Road-650 Black, 58    Road-650
1  BK-R50B-58     Road-650 Black, 58    Road-650
2  BK-R64Y-44  Road-550-W Yellow, 44  Road-550-W
3  BK-R50B-58     Road-650 Black, 58    Road-650
4  BK-R50B-58     Road-650 Black, 58    Road-650

                                  ProductDescription ProductColor ProductSize  \
0  Value-priced bike with many features of our to...        Black          58
1  Value-priced bike with many features of our to...        Black          58
2  Same technology as all of our Road series bike...       Yellow          44
3  Value-priced bike with many features of our to...        Black          58
4  Value-priced bike with many features of our to...        Black          58

  ProductStyle  ProductCost  ProductPrice Prefix FirstName LastName  \
0            U     413.1463      699.0982    MR.      JOHN   THOMAS
1            U     413.1463      699.0982    MR.     KEVIN  EDWARDS
2            W     605.6492     1000.4375    MR.     KEVIN  EDWARDS
3            U     413.1463      699.0982    MR.    JESSIE      GAO
4            U     413.1463      699.0982    MR.     TERRY      JAI

    BirthDate MaritalStatus Gender                  EmailAddress AnnualIncome  \
0  11/11/1958             M      M    john48@adventure-works.com     $80,000
1  11/11/1953             M      M   kevin38@adventure-works.com     $30,000
2  11/11/1953             M      M   kevin38@adventure-works.com     $30,000
3  10/28/1944             S      M  jessie19@adventure-works.com    $130,000
4    9/3/1973             S      M   terry14@adventure-works.com     $30,000

   TotalChildren   EducationLevel      Occupation HomeOwner SubcategoryName  \
0              1  Partial College  Skilled Manual         N      Road Bikes
1              1        Bachelors  Skilled Manual         Y      Road Bikes
2              1        Bachelors  Skilled Manual         Y      Road Bikes
3              3        Bachelors      Management         N      Road Bikes
4              0  Partial College        Clerical         N      Road Bikes

   ProductCategoryKey CategoryName
0                   1        Bikes
1                   1        Bikes
2                   1        Bikes
3                   1        Bikes
4                   1        Bikes

In [204]:
#final_.to_csv("final.csv")

In [5]:
final_= pd.read_csv("final.csv", low_memory=False)

Dashboard of all time
    
    Top 5 Products
    Top 5 Category
    Top 5 valuable Customer by sales amount.

In [6]:
final_.groupby(['ProductName'])['OrderQuantity'].sum().nlargest(5)

ProductName
Water Bottle - 30 oz.    7967
Patch Kit/8 Patches      5898
Mountain Tire Tube       5678
Road Tire Tube           4327
AWC Logo Cap             4151
Name: OrderQuantity, dtype: int64

In [7]:
final_.groupby(['CategoryName'])['OrderQuantity'].sum().nlargest(5)

CategoryName
Accessories    57809
Bikes          13929
Clothing       12436
Name: OrderQuantity, dtype: int64

In [8]:
final_.groupby(['CategoryName', 'SubcategoryName'])['OrderQuantity'].sum().nlargest(5)

CategoryName  SubcategoryName
Accessories   Tires and Tubes      29772
              Bottles and Cages    15106
Bikes         Road Bikes            7099
Accessories   Helmets               6034
Bikes         Mountain Bikes        4706
Name: OrderQuantity, dtype: int64

DATE

    Orders by year, month
    peak days of orders from previous date data
    pivot table of all the products month wise
    how many peoples orderes on there birthdate

In [9]:
bday=final_[(final_["b_date"] == final_["s_date"])& (final_["b_month"] == final_["s_month"])]

In [10]:
bday[["OrderDate", "BirthDate", "FirstName", "ProductName", "ProductPrice"]].sort_values(by="ProductPrice", ascending=False)[:10]

        OrderDate   BirthDate FirstName              ProductName  ProductPrice
32     2015-06-15  1955-06-15    JEREMY         Road-150 Red, 48     3578.2700
25427  2015-03-24  1958-03-24    DAKOTA         Road-150 Red, 44     3578.2700
418    2016-01-28  1957-01-28    ANDREW         Road-250 Red, 52     2443.3500
38502  2016-06-16  1972-06-16     ROGER         Road-250 Red, 52     2443.3500
38534  2016-01-23  1959-01-23   TIFFANY         Road-250 Red, 44     2443.3500
40376  2017-02-23  1962-02-23  MEREDITH    Touring-1000 Blue, 60     2384.0700
27641  2017-03-11  1971-03-11   MARISSA    Touring-1000 Blue, 60     2384.0700
21394  2017-04-28  1971-04-28      CARA  Touring-1000 Yellow, 60     2384.0700
40237  2017-06-13  1961-06-13     TONYA  Touring-1000 Yellow, 60     2384.0700
36766  2016-12-24  1971-12-24     JANET       Road-250 Black, 48     2181.5625

In [11]:
final_.groupby(['s_year'])["t_purchase"].sum()

s_year
2015    6.407564e+06
2016    9.224054e+06
2017    9.055032e+06
Name: t_purchase, dtype: float64

In [12]:
final_.groupby(['s_year','s_month'])["t_purchase"].sum().unstack()

s_month,1,2,3,4,5,6,7,8,9,10,11,12
s_year,,,,,,,,,,,,
2015,5.854966e+05,5.323912e+05,6.436341e+05,6.535680e+05,6.595319e+05,6.702007e+05,486362.0054,536730.8175,344258.8749,4.044996e+05,3.268022e+05,5.640875e+05
2016,4.326677e+05,4.744298e+05,4.722279e+05,4.952474e+05,5.458637e+05,5.341370e+05,811337.7659,785268.8195,934285.0581,1.010609e+06,1.115460e+06,1.612519e+06
2017,1.253160e+06,1.319117e+06,1.427391e+06,1.505711e+06,1.745515e+06,1.804138e+06,NaN,NaN,NaN,NaN,NaN,NaN

SALES

    Most products orders region wise.

In [13]:
final_.groupby(["Region","s_year"])["t_purchase"].sum().unstack()

s_year                  2015          2016          2017
Region
Australia       2.121513e+06  2.869263e+06  2.382692e+06
Canada          6.107154e+05  5.046924e+05  6.195928e+05
Central                  NaN  2.781832e+03  2.444223e+02
France          5.035513e+05  9.762008e+05  8.615709e+05
Germany         5.042398e+05  9.955697e+05  1.003481e+06
Northeast                NaN  3.979175e+03  2.341731e+03
Northwest       8.348346e+05  1.036220e+06  1.189261e+06
Southeast       7.000982e+02  2.941626e+03  7.861518e+03
Southwest       1.264722e+06  1.627413e+06  1.883612e+06
United Kingdom  5.672881e+05  1.204993e+06  1.104376e+06


    Annual Income & product purchase relation
    Most purchased order by customer name, Territory wise,
    Female most ordered product vs male most oder product
    Gender , home owner matters in order purchasing
    best age group to target for sell.
    Education level and child and annual income relation.
    Martial Status single and above 50 age purchase
    Top annual income persons ordered product
    Most ordered proudct customer name and there annual income
    People who bachelors & Clerical & Home owner & annual Income 40000

In [143]:
final_["AnnualIncome"]

0        80000.0
1        30000.0
2        30000.0
3        60000.0
4        40000.0
          ...
56041    40000.0
56042    70000.0
56043    40000.0
56044    70000.0
56045    60000.0
Name: AnnualIncome, Length: 56046, dtype: float64

In [144]:
final_["AnnualIncome"].corr(final_["t_purchase"])

0.07305839867557483

In [167]:
topcust=final_.groupby(["Region", "CustomerKey"])['t_purchase'].sum().sort_values(ascending=False).to_frame()

In [170]:
topcust

                       t_purchase
Region    CustomerKey
France    11433        12411.9645
          11439        11996.4529
          11241        11253.3171
          11417        11025.5420
          11420        10970.8160
...                           ...
Southwest 27993            4.2900
          11209            3.2900
          28016            3.2900
Australia 18304            3.2900
Northwest 28093            3.2900

[17416 rows x 1 columns]

In [180]:
male=final_[final_["Gender"]=="M"]
female=final_[final_["Gender"]=="F"]

In [181]:
male.groupby(['ProductName'])['OrderQuantity'].sum().nlargest(5)

ProductName
Water Bottle - 30 oz.    4047
Patch Kit/8 Patches      2976
Mountain Tire Tube       2883
Road Tire Tube           2197
AWC Logo Cap             2053
Name: OrderQuantity, dtype: int64

In [182]:
female.groupby(['ProductName'])['OrderQuantity'].sum().nlargest(5)

ProductName
Water Bottle - 30 oz.    3869
Patch Kit/8 Patches      2879
Mountain Tire Tube       2760
Road Tire Tube           2085
AWC Logo Cap             2064
Name: OrderQuantity, dtype: int64

In [184]:
len(male["HomeOwner"]=="Y")

28071

In [185]:
len(female["HomeOwner"]=="Y")

27595

In [188]:
final_["age"]

0        63
1        68
2        68
3        47
4        41
         ..
56041    44
56042    59
56043    73
56044    59
56045    62
Name: age, Length: 56046, dtype: int64

In [208]:
age_bins=[0,40,50,60,70,80,100]
groupnames= ["0-40","40-50", "50-60", "60-70", "70-80", "60-100"]

In [209]:
final_["cats"]=pd.cut(final_.age, age_bins, right= False, labels= groupnames)

In [210]:
final_["cats"].value_counts()

50-60     18015
40-50     16804
60-70     11605
70-80      5628
0-40       2679
60-100     1283
Name: cats, dtype: int64

In [212]:
final_.groupby(["EducationLevel", "Occupation"])["TotalChildren"].mean().unstack()

Occupation,Clerical,Management,Manual,Professional,Skilled Manual
EducationLevel,,,,,
Bachelors,0.659049,2.834988,0.995370,1.458903,1.836415
Graduate Degree,1.362782,2.290410,0.695122,2.191712,1.154734
High School,1.186441,2.106814,1.303534,2.862081,1.541880
Partial College,1.732939,1.792857,1.119871,2.871107,1.028490
Partial High School,1.617671,1.109589,1.082958,1.326415,2.591182

In [214]:
final_.groupby(["EducationLevel", "Occupation"])["AnnualIncome"].mean().unstack()

Occupation,Clerical,Management,Manual,Professional,Skilled Manual
EducationLevel,,,,,
Bachelors,28549.440299,90137.013503,11111.111111,69313.217036,48818.552178
Graduate Degree,33082.706767,92445.717732,11585.365854,66560.805577,56752.886836
High School,30000.000000,108324.125230,18449.064449,74635.716706,39176.068376
Partial College,34836.109618,119964.285714,16251.728907,86073.170732,59422.429422
Partial High School,24715.111478,131643.835616,15228.295820,117018.867925,65060.120240

In [213]:
final_.groupby(["EducationLevel", "Occupation"])["t_purchase"].mean().unstack()

Occupation,Clerical,Management,Manual,Professional,Skilled Manual
EducationLevel,,,,,
Bachelors,558.754159,431.522375,213.806296,534.023584,482.810163
Graduate Degree,557.331506,505.878490,369.805674,486.453658,345.925068
High School,261.652660,526.553579,388.665751,416.934883,360.297687
Partial College,425.005896,474.448035,439.352701,400.147947,431.746783
Partial High School,197.709173,418.123623,282.962826,711.395062,307.165803

In [228]:
final_["AnnualIncome"]

0        80000.0
1        30000.0
2        30000.0
3        60000.0
4        40000.0
          ...
56041    40000.0
56042    70000.0
56043    40000.0
56044    70000.0
56045    60000.0
Name: AnnualIncome, Length: 56046, dtype: float64

In [233]:
final_[final_["AnnualIncome"]==80000].groupby(['ProductName'])['OrderQuantity'].sum().nlargest(5)

ProductName
Water Bottle - 30 oz.    679
Mountain Tire Tube       551
Patch Kit/8 Patches      505
Fender Set - Mountain    424
Mountain Bottle Cage     320
Name: OrderQuantity, dtype: int64

In [234]:
rangeincome=final_["AnnualIncome"].unique()

In [247]:
p={}
l=[]
for i in rangeincome:
    x=final_[final_["AnnualIncome"]==i].groupby(["AnnualIncome",'ProductName'])['OrderQuantity'].sum().nlargest(5)
    l.append(x)

In [260]:
final_.groupby(["AnnualIncome",'ProductName'])['OrderQuantity'].sum()

AnnualIncome  ProductName
10000.0       AWC Logo Cap                  251
              All-Purpose Bike Stand         15
              Bike Wash - Dissolver          67
              Classic Vest, L                 8
              Classic Vest, M                 6
                                           ...
170000.0      Touring-3000 Blue, 58           1
              Touring-3000 Yellow, 44         1
              Water Bottle - 30 oz.          71
              Women's Mountain Shorts, M      2
              Women's Mountain Shorts, S      2
Name: OrderQuantity, Length: 1828, dtype: int64